ci4app/app/Models/PengeluaranSubbidangModel.php

SELECT *
FROM `pengeluaran_subbidang`
WHERE `created_at` >= '2025-08-01 00:00:00'
AND `created_at` <= '2025-08-02 23:59:59'
---
    public function getByDateRange($start, $end)
{
    return $this->where('created_at >=', $start)
                ->where('created_at <=', $end)
                ->findAll();