ci4app/app/Controllers/PengeluaranBidang.php

SELECT SUM(`jumlah_pengeluaran`) AS `jumlah_pengeluaran`
FROM `pengeluaran_bidang`
---
    public function index()
    {
        // Query total penggunaan (jumlah_pengeluaran) dari setiap tabel bidang
        $model      = new PengeluaranBidangModel();
        $model1     = new PengeluaranBidangModel1();
        $model2     = new PengeluaranBidangModel2();
        $model3     = new PengeluaranBidangModel3();
        $model4     = new PengeluaranBidangModel4();

        $data['total_penggunaan'] = [
            'each'  => $model->selectSum('jumlah_pengeluaran')->get()->getRow()->jumlah_pengeluaran ?? 0,
            'each1' => $model1->selectSum('jumlah_pengeluaran')->get()->getRow()->jumlah_pengeluaran ?? 0,
            'each2' => $model2->selectSum('jumlah_pengeluaran')->get()->getRow()->jumlah_pengeluaran ?? 0,
            'each3' => $model3->selectSum('jumlah_pengeluaran')->get()->getRow()->jumlah_pengeluaran ?? 0,
            'each4' => $model4->selectSum('jumlah_pengeluaran')->get()->getRow()->jumlah_pengeluaran ?? 0,
        ];