ci4app/app/Controllers/Pengeluaran.php

    public function index()
    {
        $model = new PengeluaranModel();
        $data['pengeluaran'] = $model->findAll();
---
SELECT *
FROM `pengeluaran`

    public function delete($id)
{
    $model = new \App\Models\PengeluaranModel();
    $existing = $model->find($id);

    // Hapus file nota jika ada
    if (!empty($existing['nota']) && file_exists('uploads/nota/' . $existing['nota'])) {
        unlink('uploads/nota/' . $existing['nota']);
    }

    $model->delete($id);
---
SELECT *
FROM `pengeluaran`
WHERE `pengeluaran`.`id` = '5'
DELETE FROM `pengeluaran`
WHERE `id` IN ('5')