ci4app/app/Controllers/PengeluaranKegiatan.php

SELECT *
FROM `pengeluaran_kegiatan`
---
    public function index()
    {
        $model = new PengeluaranKegiatanModel();
        $data['kegiatan'] = $model->findAll();